# Handling date

In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

### **Working with dates**

In [3]:
# by default the data and time are in string type, you have to change their data type into date and time

# converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])
print(date.info(), '\n')

# extracting year
date['year'] = date['date'].dt.year        # here dt = date time
date.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB
None

        date  product_id  city_id  orders  year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018
2 2018-10-23        1859       25       1  2018

In [4]:
# extracting month and month name
date['month'] = date['date'].dt.month
date['month_name'] = date['date'].dt.month_name()
date = date.drop(columns=['product_id', 'city_id', 'orders'])       # dropping unnecessary columns
date.head(3)

        date  year  month month_name
0 2019-12-10  2019     12   December
1 2018-08-15  2018      8     August
2 2018-10-23  2018     10    October

In [5]:
# extracting day, day of week
date['day'] = date['date'].dt.day
date['day_of_week'] = date['date'].dt.dayofweek         # wheather first day of the week or second of the week, etc
date.head(3)

        date  year  month month_name  day  day_of_week
0 2019-12-10  2019     12   December   10            1
1 2018-08-15  2018      8     August   15            2
2 2018-10-23  2018     10    October   23            1

In [6]:
# day of week - name
date['day_name'] = date['date'].dt.day_name()
date.head(3)

        date  year  month month_name  day  day_of_week   day_name
0 2019-12-10  2019     12   December   10            1    Tuesday
1 2018-08-15  2018      8     August   15            2  Wednesday
2 2018-10-23  2018     10    October   23            1    Tuesday

In [7]:
# is weekend or not 
date['weekend_or_not'] = np.where(date['day_name'].isin(['Sunday', 'Saturday']), 1,0)   # 1 = weekend, 0 = not a weekend
date.head()

,date,year,month,month_name,day,day_of_week,day_name,weekend_or_not
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [8]:
# extracting which no. of week of the year
date['week_no.'] = date['date'].dt.isocalendar().week       # prints the given is falling under which no. of week of the year
date.head()

,date,year,month,month_name,day,day_of_week,day_name,weekend_or_not,week_no.
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

In [9]:
# extracting quarter
date['quarter_no.'] = date['date'].dt.quarter
date.head(3)

,date,year,month,month_name,day,day_of_week,day_name,weekend_or_not,week_no.,quarter_no.
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4

In [15]:
# extracting semester
date['semester'] = np.where(date['quarter_no.'].isin([1,2]), 1,2)      # a year contains 2 sems, each consisting of six months
date.head(3)

,date,year,month,month_name,day,day_of_week,day_name,weekend_or_not,week_no.,quarter_no.,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2

In [16]:
import datetime         
today = datetime.datetime.today()
today       # will print todays date and time

datetime.datetime(2025, 11, 28, 6, 44, 9, 96053)

In [12]:
# extracting date difference
date['date'] = pd.to_datetime(date['date'])
today - date['date']

0     2180 days 06:44:00.079610
1     2662 days 06:44:00.079610
2     2593 days 06:44:00.079610
3     2295 days 06:44:00.079610
4     2518 days 06:44:00.079610
                 ...
995   2608 days 06:44:00.079610
996   2549 days 06:44:00.079610
997   2397 days 06:44:00.079610
998   2462 days 06:44:00.079610
999   2236 days 06:44:00.079610
Name: date, Length: 1000, dtype: timedelta64[ns]

In [13]:
# days
(today - date['date']).dt.days  # will print the remaining number of days

0      2180
1      2662
2      2593
3      2295
4      2518
       ...
995    2608
996    2549
997    2397
998    2462
999    2236
Name: date, Length: 1000, dtype: int64

In [17]:
# months passed
np.round((today - date['date']) / np.timedelta64(30, 'D'), 0)

0      73.0
1      89.0
2      86.0
3      77.0
4      84.0
       ...
995    87.0
996    85.0
997    80.0
998    82.0
999    75.0
Name: date, Length: 1000, dtype: float64